// activity//courierGame/guize/guize.js
const brand = getApp().config.brand

let fol = [
  '1. 在规定时间内控制圣诞老人在冰面上滑行、跳跃来收取礼物，每个礼物内包含随机数量的金币，收取礼物越多获得金币越多，如触碰到障碍物则会减少相应的金币。',
  '2. 每名用户每天有3次游戏机会，3次机会用完后，可以邀请好友助力获得额外的游戏机会。每邀请1人将额外获得1次机会，每位好友仅可给同一人助力一次。',
  '3. 每人每天仅可给不同好友至多助力2次。',
  '4. 每邀请5人，将有机会开启宝箱，宝箱内有更多惊喜哦。',
  '5. 获得的金币可在兑换中心内兑换游戏奖励，对应消耗金币数量以页面显示为准。',
  '6. 奖品数量有限，先到先得，具体以兑换界面数量为准。'
]
let other = [
  '1. 在规定时间内控制圣诞老人在冰面上滑行、跳跃来收取礼物，每个礼物内包含随机数量的金币，收取礼物越多获得金币越多，如触碰到障碍物则会减少相应的金币。',
  '2. 每名用户每天有3次游戏机会，3次机会用完后，可以邀请好友助力获得额外的游戏机会。每邀请1人将额外获得1次机会，每位好友仅可给同一人助力一次。',
  '3. 每邀请5人，将有机会开启宝箱，宝箱内有更多惊喜哦。',
  '4. 获得的金币可在兑换中心内兑换游戏奖励，对应消耗金币数量以页面显示为准。',
  '5. 奖品数量有限，先到先得，具体以兑换界面数量为准。',
]
Page({

  /**
   * 页面的初始数据
   */
  data: {
    texts : []

  },

  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    wx.hideShareMenu();
    let texts = this.data.texts

    switch (brand) {
        case 'FOL':
          texts = fol
          break;
    
      default:
        texts = other
        break;
    }
    this.setData({texts})

  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {

  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {

  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {

  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {

  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {

  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {

  }
})